GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.h
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0xEB4);
// bitfield macros
#define _SSP1SSPPS_PIN_POSN                                 0x0
#define _SSP1SSPPS_PIN_POSITION                             0x0
#define _SSP1SSPPS_PIN_SIZE                                 0x3
#define _SSP1SSPPS_PIN_LENGTH                               0x3
#define _SSP1SSPPS_PIN_MASK                                 0x7
#define _SSP1SSPPS_PORT_POSN                                0x3
#define _SSP1SSPPS_PORT_POSITION                            0x3
#define _SSP1SSPPS_PORT_SIZE                                0x2
#define _SSP1SSPPS_PORT_LENGTH                              0x2
#define _SSP1SSPPS_PORT_MASK                                0x18
#define _SSP1SSPPS_SSPSSPPS0_POSN                           0x0
#define _SSP1SSPPS_SSPSSPPS0_POSITION                       0x0
#define _SSP1SSPPS_SSPSSPPS0_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS0_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS0_MASK                           0x1
#define _SSP1SSPPS_SSPSSPPS1_POSN                           0x1
#define _SSP1SSPPS_SSPSSPPS1_POSITION                       0x1
#define _SSP1SSPPS_SSPSSPPS1_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS1_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS1_MASK                           0x2
#define _SSP1SSPPS_SSPSSPPS2_POSN                           0x2
#define _SSP1SSPPS_SSPSSPPS2_POSITION                       0x2
#define _SSP1SSPPS_SSPSSPPS2_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS2_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS2_MASK                           0x4
#define _SSP1SSPPS_SSPSSPPS3_POSN                           0x3
#define _SSP1SSPPS_SSPSSPPS3_POSITION                       0x3
#define _SSP1SSPPS_SSPSSPPS3_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS3_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS3_MASK                           0x8
#define _SSP1SSPPS_SSPSSPPS4_POSN                           0x4
#define _SSP1SSPPS_SSPSSPPS4_POSITION                       0x4
#define _SSP1SSPPS_SSPSSPPS4_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS4_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS4_MASK                           0x10
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x5
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x5
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x1F
#define _SSP1SSPPS_SSP1SSPPS0_POSN                          0x0
#define _SSP1SSPPS_SSP1SSPPS0_POSITION                      0x0
#define _SSP1SSPPS_SSP1SSPPS0_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS0_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS0_MASK                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSN                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSITION                      0x1
#define _SSP1SSPPS_SSP1SSPPS1_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS1_MASK                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSN                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSITION                      0x2
#define _SSP1SSPPS_SSP1SSPPS2_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS2_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS2_MASK                          0x4
#define _SSP1SSPPS_SSP1SSPPS3_POSN                          0x3
#define _SSP1SSPPS_SSP1SSPPS3_POSITION                      0x3
#define _SSP1SSPPS_SSP1SSPPS3_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS3_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS3_MASK                          0x8
#define _SSP1SSPPS_SSP1SSPPS4_POSN                          0x4
#define _SSP1SSPPS_SSP1SSPPS4_POSITION                      0x4
#define _SSP1SSPPS_SSP1SSPPS4_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS4_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS4_MASK                          0x10
#define _SSP1SSPPS_SSPSSPPS_POSN                            0x0
#define _SSP1SSPPS_SSPSSPPS_POSITION                        0x0
#define _SSP1SSPPS_SSPSSPPS_SIZE                            0x5
#define _SSP1SSPPS_SSPSSPPS_LENGTH                          0x5
#define _SSP1SSPPS_SSPSSPPS_MASK                            0x1F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS0              :1;
        unsigned SSPSSPPS1              :1;
        unsigned SSPSSPPS2              :1;
        unsigned SSPSSPPS3              :1;
        unsigned SSPSSPPS4              :1;
    };
    struct {
        unsigned SSP1SSPPS              :5;
    };
    struct {
        unsigned SSP1SSPPS0             :1;
        unsigned SSP1SSPPS1             :1;
        unsigned SSP1SSPPS2             :1;
        unsigned SSP1SSPPS3             :1;
        unsigned SSP1SSPPS4             :1;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
} SSPSSPPSbits_t;
extern volatile SSPSSPPSbits_t SSPSSPPSbits __at(0xEB4);
// bitfield macros
#define _SSPSSPPS_PIN_POSN                                  0x0
#define _SSPSSPPS_PIN_POSITION                              0x0
#define _SSPSSPPS_PIN_SIZE                                  0x3
#define _SSPSSPPS_PIN_LENGTH                                0x3
#define _SSPSSPPS_PIN_MASK                                  0x7
#define _SSPSSPPS_PORT_POSN                                 0x3
#define _SSPSSPPS_PORT_POSITION                             0x3
#define _SSPSSPPS_PORT_SIZE                                 0x2
#define _SSPSSPPS_PORT_LENGTH                               0x2
#define _SSPSSPPS_PORT_MASK                                 0x18
#define _SSPSSPPS_SSPSSPPS0_POSN                            0x0
#define _SSPSSPPS_SSPSSPPS0_POSITION                        0x0
#define _SSPSSPPS_SSPSSPPS0_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS0_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS0_MASK                            0x1
#define _SSPSSPPS_SSPSSPPS1_POSN                            0x1
#define _SSPSSPPS_SSPSSPPS1_POSITION                        0x1
#define _SSPSSPPS_SSPSSPPS1_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS1_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS1_MASK                            0x2
#define _SSPSSPPS_SSPSSPPS2_POSN                            0x2
#define _SSPSSPPS_SSPSSPPS2_POSITION                        0x2
#define _SSPSSPPS_SSPSSPPS2_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS2_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS2_MASK                            0x4
#define _SSPSSPPS_SSPSSPPS3_POSN                            0x3
#define _SSPSSPPS_SSPSSPPS3_POSITION                        0x3
#define _SSPSSPPS_SSPSSPPS3_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS3_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS3_MASK                            0x8
#define _SSPSSPPS_SSPSSPPS4_POSN                            0x4
#define _SSPSSPPS_SSPSSPPS4_POSITION                        0x4
#define _SSPSSPPS_SSPSSPPS4_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS4_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS4_MASK                            0x10
#define _SSPSSPPS_SSP1SSPPS_POSN                            0x0
#define _SSPSSPPS_SSP1SSPPS_POSITION                        0x0
#define _SSPSSPPS_SSP1SSPPS_SIZE                            0x5
#define _SSPSSPPS_SSP1SSPPS_LENGTH                          0x5
#define _SSPSSPPS_SSP1SSPPS_MASK                            0x1F
#define _SSPSSPPS_SSP1SSPPS0_POSN                           0x0
#define _SSPSSPPS_SSP1SSPPS0_POSITION                       0x0
#define _SSPSSPPS_SSP1SSPPS0_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS0_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS0_MASK                           0x1
#define _SSPSSPPS_SSP1SSPPS1_POSN                           0x1
#define _SSPSSPPS_SSP1SSPPS1_POSITION                       0x1
#define _SSPSSPPS_SSP1SSPPS1_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS1_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS1_MASK                           0x2
#define _SSPSSPPS_SSP1SSPPS2_POSN                           0x2
#define _SSPSSPPS_SSP1SSPPS2_POSITION                       0x2
#define _SSPSSPPS_SSP1SSPPS2_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS2_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS2_MASK                           0x4
#define _SSPSSPPS_SSP1SSPPS3_POSN                           0x3
#define _SSPSSPPS_SSP1SSPPS3_POSITION                       0x3
#define _SSPSSPPS_SSP1SSPPS3_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS3_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS3_MASK                           0x8
#define _SSPSSPPS_SSP1SSPPS4_POSN                           0x4
#define _SSPSSPPS_SSP1SSPPS4_POSITION                       0x4
#define _SSPSSPPS_SSP1SSPPS4_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS4_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS4_MASK                           0x10
#define _SSPSSPPS_SSPSSPPS_POSN                             0x0
#define _SSPSSPPS_SSPSSPPS_POSITION                         0x0
#define _SSPSSPPS_SSPSSPPS_SIZE                             0x5
#define _SSPSSPPS_SSPSSPPS_LENGTH                           0x5
#define _SSPSSPPS_SSPSSPPS_MASK                             0x1F

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0xEB5);
#ifndef _LIB_BUILD
asm("IPR0 equ 0EB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned INT1IP                 :1;
        unsigned INT2IP                 :1;
        unsigned                        :1;
        unsigned IOCIP                  :1;
        unsigned TMR0IP                 :1;
    };
} IPR0bits_t;
extern volatile IPR0bits_t IPR0bits __at(0xEB5);
// bitfield macros
#define _IPR0_INT0IP_POSN                                   0x0
#define _IPR0_INT0IP_POSITION                               0x0
#define _IPR0_INT0IP_SIZE                                   0x1
#define _IPR0_INT0IP_LENGTH                                 0x1
#define _IPR0_INT0IP_MASK                                   0x1
#define _IPR0_INT1IP_POSN                                   0x1
#define _IPR0_INT1IP_POSITION                               0x1
#define _IPR0_INT1IP_SIZE                                   0x1
#define _IPR0_INT1IP_LENGTH                                 0x1
#define _IPR0_INT1IP_MASK                                   0x2
#define _IPR0_INT2IP_POSN                                   0x2
#define _IPR0_INT2IP_POSITION                               0x2
#define _IPR0_INT2IP_SIZE                                   0x1
#define _IPR0_INT2IP_LENGTH                                 0x1
#define _IPR0_INT2IP_MASK                                   0x4
#define _IPR0_IOCIP_POSN                                    0x4
#define _IPR0_IOCIP_POSITION                                0x4
#define _IPR0_IOCIP_SIZE                                    0x1
#define _IPR0_IOCIP_LENGTH                                  0x1
#define _IPR0_IOCIP_MASK                                    0x10
#define _IPR0_TMR0IP_POSN                                   0x5
#define _IPR0_TMR0IP_POSITION                               0x5
#define _IPR0_TMR0IP_SIZE                                   0x1
#define _IPR0_TMR0IP_LENGTH                                 0x1
#define _IPR0_TMR0IP_MASK                                   0x20

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0xEB6);
#ifndef _LIB_BUILD
asm("IPR1 equ 0EB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIP                   :1;
        unsigned ADTIP                  :1;
        unsigned                        :4;
        unsigned CSWIP                  :1;
        unsigned OSCFIP                 :1;
    };
} IPR1bits_t;
extern volatile IPR1bits_t IPR1bits __at(0xEB6);
// bitfield macros
#define _IPR1_ADIP_POSN                                     0x0
#define _IPR1_ADIP_POSITION                                 0x0
#define _IPR1_ADIP_SIZE                                     0x1
#define _IPR1_ADIP_LENGTH                                   0x1
#define _IPR1_ADIP_MASK                                     0x1
#define _IPR1_ADTIP_POSN                                    0x1
#define _IPR1_ADTIP_POSITION                                0x1
#define _IPR1_ADTIP_SIZE                                    0x1
#define _IPR1_ADTIP_LENGTH                                  0x1
#define _IPR1_ADTIP_MASK                                    0x2
#define _IPR1_CSWIP_POSN                                    0x6
#define _IPR1_CSWIP_POSITION                                0x6
#define _IPR1_CSWIP_SIZE                                    0x1
#define _IPR1_CSWIP_LENGTH                                  0x1
#define _IPR1_CSWIP_MASK                                    0x40
#define _IPR1_OSCFIP_POSN                                   0x7
#define _IPR1_OSCFIP_POSITION                               0x7
#define _IPR1_OSCFIP_SIZE                                   0x1
#define _IPR1_OSCFIP_LENGTH                                 0x1
#define _IPR1_OSCFIP_MASK                                   0x80

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0xEB7);
#ifndef _LIB_BUILD
asm("IPR2 equ 0EB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IP                   :1;
        unsigned C2IP                   :1;
        unsigned                        :4;
        unsigned ZCDIP                  :1;
        unsigned HLVDIP                 :1;
    };
} IPR2bits_t;
extern volatile IPR2bits_t IPR2bits __at(0xEB7);
// bitfield macros
#define _IPR2_C1IP_POSN                                     0x0
#define _IPR2_C1IP_POSITION                                 0x0
#define _IPR2_C1IP_SIZE                                     0x1
#define _IPR2_C1IP_LENGTH                                   0x1
#define _IPR2_C1IP_MASK                                     0x1
#define _IPR2_C2IP_POSN                                     0x1
#define _IPR2_C2IP_POSITION                                 0x1
#define _IPR2_C2IP_SIZE                                     0x1
#define _IPR2_C2IP_LENGTH                                   0x1
#define _IPR2_C2IP_MASK                                     0x2
#define _IPR2_ZCDIP_POSN                                    0x6
#define _IPR2_ZCDIP_POSITION                                0x6
#define _IPR2_ZCDIP_SIZE                                    0x1
#define _IPR2_ZCDIP_LENGTH                                  0x1
#define _IPR2_ZCDIP_MASK                                    0x40
#define _IPR2_HLVDIP_POSN                                   0x7
#define _IPR2_HLVDIP_POSITION                               0x7
#define _IPR2_HLVDIP_SIZE                                   0x1
#define _IPR2_HLVDIP_LENGTH                                 0x1
#define _IPR2_HLVDIP_MASK                                   0x80

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0xEB8);
#ifndef _LIB_BUILD
asm("IPR3 equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPIP                  :1;
        unsigned BCLIP                  :1;
        unsigned SSP2IP                 :1;
        unsigned BCL2IP                 :1;
        unsigned TXIP                   :1;
        unsigned RCIP                   :1;
        unsigned TX2IP                  :1;
        unsigned RC2IP                  :1;
    };
    struct {
        unsigned SSP1IP                 :1;
        unsigned BCL1IP                 :1;
        unsigned                        :2;
        unsigned TX1IP                  :1;
        unsigned RC1IP                  :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0xEB8);
// bitfield macros
#define _IPR3_SSPIP_POSN                                    0x0
#define _IPR3_SSPIP_POSITION                                0x0
#define _IPR3_SSPIP_SIZE                                    0x1
#define _IPR3_SSPIP_LENGTH                                  0x1
#define _IPR3_SSPIP_MASK                                    0x1
#define _IPR3_BCLIP_POSN                                    0x1
#define _IPR3_BCLIP_POSITION                                0x1
#define _IPR3_BCLIP_SIZE                                    0x1
#define _IPR3_BCLIP_LENGTH                                  0x1
#define _IPR3_BCLIP_MASK                                    0x2
#define _IPR3_SSP2IP_POSN                                   0x2
#define _IPR3_SSP2IP_POSITION                               0x2
#define _IPR3_SSP2IP_SIZE                                   0x1
#define _IPR3_SSP2IP_LENGTH                                 0x1
#define _IPR3_SSP2IP_MASK                                   0x4
#define _IPR3_BCL2IP_POSN                                   0x3
#define _IPR3_BCL2IP_POSITION                               0x3
#define _IPR3_BCL2IP_SIZE                                   0x1
#define _IPR3_BCL2IP_LENGTH                                 0x1
#define _IPR3_BCL2IP_MASK                                   0x8
#define _IPR3_TXIP_POSN                                     0x4
#define _IPR3_TXIP_POSITION                                 0x4
#define _IPR3_TXIP_SIZE                                     0x1
#define _IPR3_TXIP_LENGTH                                   0x1
#define _IPR3_TXIP_MASK                                     0x10
#define _IPR3_RCIP_POSN                                     0x5
#define _IPR3_RCIP_POSITION                                 0x5
#define _IPR3_RCIP_SIZE                                     0x1
#define _IPR3_RCIP_LENGTH                                   0x1
#define _IPR3_RCIP_MASK                                     0x20
#define _IPR3_TX2IP_POSN                                    0x6
#define _IPR3_TX2IP_POSITION                                0x6
#define _IPR3_TX2IP_SIZE                                    0x1
#define _IPR3_TX2IP_LENGTH                                  0x1
#define _IPR3_TX2IP_MASK                                    0x40
#define _IPR3_RC2IP_POSN                                    0x7
#define _IPR3_RC2IP_POSITION                                0x7
#define _IPR3_RC2IP_SIZE                                    0x1
#define _IPR3_RC2IP_LENGTH                                  0x1
#define _IPR3_RC2IP_MASK                                    0x80
#define _IPR3_SSP1IP_POSN                                   0x0
#define _IPR3_SSP1IP_POSITION                               0x0
#define _IPR3_SSP1IP_SIZE                                   0x1
#define _IPR3_SSP1IP_LENGTH                                 0x1
#define _IPR3_SSP1IP_MASK                                   0x1
#define _IPR3_BCL1IP_POSN                                   0x1
#define _IPR3_BCL1IP_POSITION                               0x1
#define _IPR3_BCL1IP_SIZE                                   0x1
#define _IPR3_BCL1IP_LENGTH                                 0x1
#define _IPR3_BCL1IP_MASK                                   0x2
#define _IPR3_TX1IP_POSN                                    0x4
#define _IPR3_TX1IP_POSITION                                0x4
#define _IPR3_TX1IP_SIZE                                    0x1
#define _IPR3_TX1IP_LENGTH                                  0x1
#define _IPR3_TX1IP_MASK                                    0x10
#define _IPR3_RC1IP_POSN                                    0x5
#define _IPR3_RC1IP_POSITION                                0x5
#define _IPR3_RC1IP_SIZE                                    0x1
#define _IPR3_RC1IP_LENGTH                                  0x1
#define _IPR3_RC1IP_MASK                                    0x20

