GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.h
extern volatile PIR2bits_t PIR2bits __at(0xEC7);
// bitfield macros
#define _PIR2_C1IF_POSN                                     0x0
#define _PIR2_C1IF_POSITION                                 0x0
#define _PIR2_C1IF_SIZE                                     0x1
#define _PIR2_C1IF_LENGTH                                   0x1
#define _PIR2_C1IF_MASK                                     0x1
#define _PIR2_C2IF_POSN                                     0x1
#define _PIR2_C2IF_POSITION                                 0x1
#define _PIR2_C2IF_SIZE                                     0x1
#define _PIR2_C2IF_LENGTH                                   0x1
#define _PIR2_C2IF_MASK                                     0x2
#define _PIR2_ZCDIF_POSN                                    0x6
#define _PIR2_ZCDIF_POSITION                                0x6
#define _PIR2_ZCDIF_SIZE                                    0x1
#define _PIR2_ZCDIF_LENGTH                                  0x1
#define _PIR2_ZCDIF_MASK                                    0x40
#define _PIR2_HLVDIF_POSN                                   0x7
#define _PIR2_HLVDIF_POSITION                               0x7
#define _PIR2_HLVDIF_SIZE                                   0x1
#define _PIR2_HLVDIF_LENGTH                                 0x1
#define _PIR2_HLVDIF_MASK                                   0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0xEC8);
#ifndef _LIB_BUILD
asm("PIR3 equ 0EC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPIF                  :1;
        unsigned BCLIF                  :1;
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned TXIF                   :1;
        unsigned RCIF                   :1;
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
    };
    struct {
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
        unsigned                        :2;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0xEC8);
// bitfield macros
#define _PIR3_SSPIF_POSN                                    0x0
#define _PIR3_SSPIF_POSITION                                0x0
#define _PIR3_SSPIF_SIZE                                    0x1
#define _PIR3_SSPIF_LENGTH                                  0x1
#define _PIR3_SSPIF_MASK                                    0x1
#define _PIR3_BCLIF_POSN                                    0x1
#define _PIR3_BCLIF_POSITION                                0x1
#define _PIR3_BCLIF_SIZE                                    0x1
#define _PIR3_BCLIF_LENGTH                                  0x1
#define _PIR3_BCLIF_MASK                                    0x2
#define _PIR3_SSP2IF_POSN                                   0x2
#define _PIR3_SSP2IF_POSITION                               0x2
#define _PIR3_SSP2IF_SIZE                                   0x1
#define _PIR3_SSP2IF_LENGTH                                 0x1
#define _PIR3_SSP2IF_MASK                                   0x4
#define _PIR3_BCL2IF_POSN                                   0x3
#define _PIR3_BCL2IF_POSITION                               0x3
#define _PIR3_BCL2IF_SIZE                                   0x1
#define _PIR3_BCL2IF_LENGTH                                 0x1
#define _PIR3_BCL2IF_MASK                                   0x8
#define _PIR3_TXIF_POSN                                     0x4
#define _PIR3_TXIF_POSITION                                 0x4
#define _PIR3_TXIF_SIZE                                     0x1
#define _PIR3_TXIF_LENGTH                                   0x1
#define _PIR3_TXIF_MASK                                     0x10
#define _PIR3_RCIF_POSN                                     0x5
#define _PIR3_RCIF_POSITION                                 0x5
#define _PIR3_RCIF_SIZE                                     0x1
#define _PIR3_RCIF_LENGTH                                   0x1
#define _PIR3_RCIF_MASK                                     0x20
#define _PIR3_TX2IF_POSN                                    0x6
#define _PIR3_TX2IF_POSITION                                0x6
#define _PIR3_TX2IF_SIZE                                    0x1
#define _PIR3_TX2IF_LENGTH                                  0x1
#define _PIR3_TX2IF_MASK                                    0x40
#define _PIR3_RC2IF_POSN                                    0x7
#define _PIR3_RC2IF_POSITION                                0x7
#define _PIR3_RC2IF_SIZE                                    0x1
#define _PIR3_RC2IF_LENGTH                                  0x1
#define _PIR3_RC2IF_MASK                                    0x80
#define _PIR3_SSP1IF_POSN                                   0x0
#define _PIR3_SSP1IF_POSITION                               0x0
#define _PIR3_SSP1IF_SIZE                                   0x1
#define _PIR3_SSP1IF_LENGTH                                 0x1
#define _PIR3_SSP1IF_MASK                                   0x1
#define _PIR3_BCL1IF_POSN                                   0x1
#define _PIR3_BCL1IF_POSITION                               0x1
#define _PIR3_BCL1IF_SIZE                                   0x1
#define _PIR3_BCL1IF_LENGTH                                 0x1
#define _PIR3_BCL1IF_MASK                                   0x2
#define _PIR3_TX1IF_POSN                                    0x4
#define _PIR3_TX1IF_POSITION                                0x4
#define _PIR3_TX1IF_SIZE                                    0x1
#define _PIR3_TX1IF_LENGTH                                  0x1
#define _PIR3_TX1IF_MASK                                    0x10
#define _PIR3_RC1IF_POSN                                    0x5
#define _PIR3_RC1IF_POSITION                                0x5
#define _PIR3_RC1IF_SIZE                                    0x1
#define _PIR3_RC1IF_LENGTH                                  0x1
#define _PIR3_RC1IF_MASK                                    0x20

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0xEC9);
#ifndef _LIB_BUILD
asm("PIR4 equ 0EC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR3IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned TMR5IF                 :1;
        unsigned TMR6IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0xEC9);
// bitfield macros
#define _PIR4_TMR1IF_POSN                                   0x0
#define _PIR4_TMR1IF_POSITION                               0x0
#define _PIR4_TMR1IF_SIZE                                   0x1
#define _PIR4_TMR1IF_LENGTH                                 0x1
#define _PIR4_TMR1IF_MASK                                   0x1
#define _PIR4_TMR2IF_POSN                                   0x1
#define _PIR4_TMR2IF_POSITION                               0x1
#define _PIR4_TMR2IF_SIZE                                   0x1
#define _PIR4_TMR2IF_LENGTH                                 0x1
#define _PIR4_TMR2IF_MASK                                   0x2
#define _PIR4_TMR3IF_POSN                                   0x2
#define _PIR4_TMR3IF_POSITION                               0x2
#define _PIR4_TMR3IF_SIZE                                   0x1
#define _PIR4_TMR3IF_LENGTH                                 0x1
#define _PIR4_TMR3IF_MASK                                   0x4
#define _PIR4_TMR4IF_POSN                                   0x3
#define _PIR4_TMR4IF_POSITION                               0x3
#define _PIR4_TMR4IF_SIZE                                   0x1
#define _PIR4_TMR4IF_LENGTH                                 0x1
#define _PIR4_TMR4IF_MASK                                   0x8
#define _PIR4_TMR5IF_POSN                                   0x4
#define _PIR4_TMR5IF_POSITION                               0x4
#define _PIR4_TMR5IF_SIZE                                   0x1
#define _PIR4_TMR5IF_LENGTH                                 0x1
#define _PIR4_TMR5IF_MASK                                   0x10
#define _PIR4_TMR6IF_POSN                                   0x5
#define _PIR4_TMR6IF_POSITION                               0x5
#define _PIR4_TMR6IF_SIZE                                   0x1
#define _PIR4_TMR6IF_LENGTH                                 0x1
#define _PIR4_TMR6IF_MASK                                   0x20

