GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.h
extern volatile TMR5Lbits_t TMR5Lbits __at(0xFC0);
// bitfield macros
#define _TMR5L_TMR5L0_POSN                                  0x0
#define _TMR5L_TMR5L0_POSITION                              0x0
#define _TMR5L_TMR5L0_SIZE                                  0x1
#define _TMR5L_TMR5L0_LENGTH                                0x1
#define _TMR5L_TMR5L0_MASK                                  0x1
#define _TMR5L_TMR5L1_POSN                                  0x1
#define _TMR5L_TMR5L1_POSITION                              0x1
#define _TMR5L_TMR5L1_SIZE                                  0x1
#define _TMR5L_TMR5L1_LENGTH                                0x1
#define _TMR5L_TMR5L1_MASK                                  0x2
#define _TMR5L_TMR5L2_POSN                                  0x2
#define _TMR5L_TMR5L2_POSITION                              0x2
#define _TMR5L_TMR5L2_SIZE                                  0x1
#define _TMR5L_TMR5L2_LENGTH                                0x1
#define _TMR5L_TMR5L2_MASK                                  0x4
#define _TMR5L_TMR5L3_POSN                                  0x3
#define _TMR5L_TMR5L3_POSITION                              0x3
#define _TMR5L_TMR5L3_SIZE                                  0x1
#define _TMR5L_TMR5L3_LENGTH                                0x1
#define _TMR5L_TMR5L3_MASK                                  0x8
#define _TMR5L_TMR5L4_POSN                                  0x4
#define _TMR5L_TMR5L4_POSITION                              0x4
#define _TMR5L_TMR5L4_SIZE                                  0x1
#define _TMR5L_TMR5L4_LENGTH                                0x1
#define _TMR5L_TMR5L4_MASK                                  0x10
#define _TMR5L_TMR5L5_POSN                                  0x5
#define _TMR5L_TMR5L5_POSITION                              0x5
#define _TMR5L_TMR5L5_SIZE                                  0x1
#define _TMR5L_TMR5L5_LENGTH                                0x1
#define _TMR5L_TMR5L5_MASK                                  0x20
#define _TMR5L_TMR5L6_POSN                                  0x6
#define _TMR5L_TMR5L6_POSITION                              0x6
#define _TMR5L_TMR5L6_SIZE                                  0x1
#define _TMR5L_TMR5L6_LENGTH                                0x1
#define _TMR5L_TMR5L6_MASK                                  0x40
#define _TMR5L_TMR5L7_POSN                                  0x7
#define _TMR5L_TMR5L7_POSITION                              0x7
#define _TMR5L_TMR5L7_SIZE                                  0x1
#define _TMR5L_TMR5L7_LENGTH                                0x1
#define _TMR5L_TMR5L7_MASK                                  0x80
#define _TMR5L_TMR5L_POSN                                   0x0
#define _TMR5L_TMR5L_POSITION                               0x0
#define _TMR5L_TMR5L_SIZE                                   0x8
#define _TMR5L_TMR5L_LENGTH                                 0x8
#define _TMR5L_TMR5L_MASK                                   0xFF
#define _TMR5L_TMR50_POSN                                   0x0
#define _TMR5L_TMR50_POSITION                               0x0
#define _TMR5L_TMR50_SIZE                                   0x1
#define _TMR5L_TMR50_LENGTH                                 0x1
#define _TMR5L_TMR50_MASK                                   0x1
#define _TMR5L_TMR51_POSN                                   0x1
#define _TMR5L_TMR51_POSITION                               0x1
#define _TMR5L_TMR51_SIZE                                   0x1
#define _TMR5L_TMR51_LENGTH                                 0x1
#define _TMR5L_TMR51_MASK                                   0x2
#define _TMR5L_TMR52_POSN                                   0x2
#define _TMR5L_TMR52_POSITION                               0x2
#define _TMR5L_TMR52_SIZE                                   0x1
#define _TMR5L_TMR52_LENGTH                                 0x1
#define _TMR5L_TMR52_MASK                                   0x4
#define _TMR5L_TMR53_POSN                                   0x3
#define _TMR5L_TMR53_POSITION                               0x3
#define _TMR5L_TMR53_SIZE                                   0x1
#define _TMR5L_TMR53_LENGTH                                 0x1
#define _TMR5L_TMR53_MASK                                   0x8
#define _TMR5L_TMR54_POSN                                   0x4
#define _TMR5L_TMR54_POSITION                               0x4
#define _TMR5L_TMR54_SIZE                                   0x1
#define _TMR5L_TMR54_LENGTH                                 0x1
#define _TMR5L_TMR54_MASK                                   0x10
#define _TMR5L_TMR55_POSN                                   0x5
#define _TMR5L_TMR55_POSITION                               0x5
#define _TMR5L_TMR55_SIZE                                   0x1
#define _TMR5L_TMR55_LENGTH                                 0x1
#define _TMR5L_TMR55_MASK                                   0x20
#define _TMR5L_TMR56_POSN                                   0x6
#define _TMR5L_TMR56_POSITION                               0x6
#define _TMR5L_TMR56_SIZE                                   0x1
#define _TMR5L_TMR56_LENGTH                                 0x1
#define _TMR5L_TMR56_MASK                                   0x40
#define _TMR5L_TMR57_POSN                                   0x7
#define _TMR5L_TMR57_POSITION                               0x7
#define _TMR5L_TMR57_SIZE                                   0x1
#define _TMR5L_TMR57_LENGTH                                 0x1
#define _TMR5L_TMR57_MASK                                   0x80
#define _TMR5L_CAL05_POSN                                   0x0
#define _TMR5L_CAL05_POSITION                               0x0
#define _TMR5L_CAL05_SIZE                                   0x1
#define _TMR5L_CAL05_LENGTH                                 0x1
#define _TMR5L_CAL05_MASK                                   0x1
#define _TMR5L_CAL15_POSN                                   0x1
#define _TMR5L_CAL15_POSITION                               0x1
#define _TMR5L_CAL15_SIZE                                   0x1
#define _TMR5L_CAL15_LENGTH                                 0x1
#define _TMR5L_CAL15_MASK                                   0x2
#define _TMR5L_CAL25_POSN                                   0x2
#define _TMR5L_CAL25_POSITION                               0x2
#define _TMR5L_CAL25_SIZE                                   0x1
#define _TMR5L_CAL25_LENGTH                                 0x1
#define _TMR5L_CAL25_MASK                                   0x4
#define _TMR5L_CAL35_POSN                                   0x3
#define _TMR5L_CAL35_POSITION                               0x3
#define _TMR5L_CAL35_SIZE                                   0x1
#define _TMR5L_CAL35_LENGTH                                 0x1
#define _TMR5L_CAL35_MASK                                   0x8
#define _TMR5L_CAL45_POSN                                   0x4
#define _TMR5L_CAL45_POSITION                               0x4
#define _TMR5L_CAL45_SIZE                                   0x1
#define _TMR5L_CAL45_LENGTH                                 0x1
#define _TMR5L_CAL45_MASK                                   0x10
#define _TMR5L_CAL55_POSN                                   0x5
#define _TMR5L_CAL55_POSITION                               0x5
#define _TMR5L_CAL55_SIZE                                   0x1
#define _TMR5L_CAL55_LENGTH                                 0x1
#define _TMR5L_CAL55_MASK                                   0x20
#define _TMR5L_CAL65_POSN                                   0x6
#define _TMR5L_CAL65_POSITION                               0x6
#define _TMR5L_CAL65_SIZE                                   0x1
#define _TMR5L_CAL65_LENGTH                                 0x1
#define _TMR5L_CAL65_MASK                                   0x40
#define _TMR5L_CAL75_POSN                                   0x7
#define _TMR5L_CAL75_POSITION                               0x7
#define _TMR5L_CAL75_SIZE                                   0x1
#define _TMR5L_CAL75_LENGTH                                 0x1
#define _TMR5L_CAL75_MASK                                   0x80

// Register: TMR5H
#define TMR5H TMR5H
extern volatile unsigned char           TMR5H               __at(0xFC1);
#ifndef _LIB_BUILD
asm("TMR5H equ 0FC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR5H0                 :1;
        unsigned TMR5H1                 :1;
        unsigned TMR5H2                 :1;
        unsigned TMR5H3                 :1;
        unsigned TMR5H4                 :1;
        unsigned TMR5H5                 :1;
        unsigned TMR5H6                 :1;
        unsigned TMR5H7                 :1;
    };
    struct {
        unsigned TMR5H                  :8;
    };
    struct {
        unsigned TMR58                  :1;
        unsigned TMR59                  :1;
        unsigned TMR510                 :1;
        unsigned TMR511                 :1;
        unsigned TMR512                 :1;
        unsigned TMR513                 :1;
        unsigned TMR514                 :1;
        unsigned TMR515                 :1;
    };
} TMR5Hbits_t;
extern volatile TMR5Hbits_t TMR5Hbits __at(0xFC1);
// bitfield macros
#define _TMR5H_TMR5H0_POSN                                  0x0
#define _TMR5H_TMR5H0_POSITION                              0x0
#define _TMR5H_TMR5H0_SIZE                                  0x1
#define _TMR5H_TMR5H0_LENGTH                                0x1
#define _TMR5H_TMR5H0_MASK                                  0x1
#define _TMR5H_TMR5H1_POSN                                  0x1
#define _TMR5H_TMR5H1_POSITION                              0x1
#define _TMR5H_TMR5H1_SIZE                                  0x1
#define _TMR5H_TMR5H1_LENGTH                                0x1
#define _TMR5H_TMR5H1_MASK                                  0x2
#define _TMR5H_TMR5H2_POSN                                  0x2
#define _TMR5H_TMR5H2_POSITION                              0x2
#define _TMR5H_TMR5H2_SIZE                                  0x1
#define _TMR5H_TMR5H2_LENGTH                                0x1
#define _TMR5H_TMR5H2_MASK                                  0x4
#define _TMR5H_TMR5H3_POSN                                  0x3
#define _TMR5H_TMR5H3_POSITION                              0x3
#define _TMR5H_TMR5H3_SIZE                                  0x1
#define _TMR5H_TMR5H3_LENGTH                                0x1
#define _TMR5H_TMR5H3_MASK                                  0x8
#define _TMR5H_TMR5H4_POSN                                  0x4
#define _TMR5H_TMR5H4_POSITION                              0x4
#define _TMR5H_TMR5H4_SIZE                                  0x1
#define _TMR5H_TMR5H4_LENGTH                                0x1
#define _TMR5H_TMR5H4_MASK                                  0x10
#define _TMR5H_TMR5H5_POSN                                  0x5
#define _TMR5H_TMR5H5_POSITION                              0x5
#define _TMR5H_TMR5H5_SIZE                                  0x1
#define _TMR5H_TMR5H5_LENGTH                                0x1
#define _TMR5H_TMR5H5_MASK                                  0x20
#define _TMR5H_TMR5H6_POSN                                  0x6
#define _TMR5H_TMR5H6_POSITION                              0x6
#define _TMR5H_TMR5H6_SIZE                                  0x1
#define _TMR5H_TMR5H6_LENGTH                                0x1
#define _TMR5H_TMR5H6_MASK                                  0x40
#define _TMR5H_TMR5H7_POSN                                  0x7
#define _TMR5H_TMR5H7_POSITION                              0x7
#define _TMR5H_TMR5H7_SIZE                                  0x1
#define _TMR5H_TMR5H7_LENGTH                                0x1
#define _TMR5H_TMR5H7_MASK                                  0x80
#define _TMR5H_TMR5H_POSN                                   0x0
#define _TMR5H_TMR5H_POSITION                               0x0
#define _TMR5H_TMR5H_SIZE                                   0x8
#define _TMR5H_TMR5H_LENGTH                                 0x8
#define _TMR5H_TMR5H_MASK                                   0xFF
#define _TMR5H_TMR58_POSN                                   0x0
#define _TMR5H_TMR58_POSITION                               0x0
#define _TMR5H_TMR58_SIZE                                   0x1
#define _TMR5H_TMR58_LENGTH                                 0x1
#define _TMR5H_TMR58_MASK                                   0x1
#define _TMR5H_TMR59_POSN                                   0x1
#define _TMR5H_TMR59_POSITION                               0x1
#define _TMR5H_TMR59_SIZE                                   0x1
#define _TMR5H_TMR59_LENGTH                                 0x1
#define _TMR5H_TMR59_MASK                                   0x2
#define _TMR5H_TMR510_POSN                                  0x2
#define _TMR5H_TMR510_POSITION                              0x2
#define _TMR5H_TMR510_SIZE                                  0x1
#define _TMR5H_TMR510_LENGTH                                0x1
#define _TMR5H_TMR510_MASK                                  0x4
#define _TMR5H_TMR511_POSN                                  0x3
#define _TMR5H_TMR511_POSITION                              0x3
#define _TMR5H_TMR511_SIZE                                  0x1
#define _TMR5H_TMR511_LENGTH                                0x1
#define _TMR5H_TMR511_MASK                                  0x8
#define _TMR5H_TMR512_POSN                                  0x4
#define _TMR5H_TMR512_POSITION                              0x4
#define _TMR5H_TMR512_SIZE                                  0x1
#define _TMR5H_TMR512_LENGTH                                0x1
#define _TMR5H_TMR512_MASK                                  0x10
#define _TMR5H_TMR513_POSN                                  0x5
#define _TMR5H_TMR513_POSITION                              0x5
#define _TMR5H_TMR513_SIZE                                  0x1
#define _TMR5H_TMR513_LENGTH                                0x1
#define _TMR5H_TMR513_MASK                                  0x20
#define _TMR5H_TMR514_POSN                                  0x6
#define _TMR5H_TMR514_POSITION                              0x6
#define _TMR5H_TMR514_SIZE                                  0x1
#define _TMR5H_TMR514_LENGTH                                0x1
#define _TMR5H_TMR514_MASK                                  0x40
#define _TMR5H_TMR515_POSN                                  0x7
#define _TMR5H_TMR515_POSITION                              0x7
#define _TMR5H_TMR515_SIZE                                  0x1
#define _TMR5H_TMR515_LENGTH                                0x1
#define _TMR5H_TMR515_MASK                                  0x80

// Register: T5CON
#define T5CON T5CON
extern volatile unsigned char           T5CON               __at(0xFC2);
#ifndef _LIB_BUILD
asm("T5CON equ 0FC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned NOT_SYNC               :1;
    };
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_T5SYNC             :1;
    };
    struct {
        unsigned TMR5ON                 :1;
        unsigned T5RD16                 :1;
        unsigned nT5SYNC                :1;
        unsigned                        :1;
        unsigned T5CKPS0                :1;
        unsigned T5CKPS1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD165                  :1;
    };
} T5CONbits_t;
extern volatile T5CONbits_t T5CONbits __at(0xFC2);
// bitfield macros
#define _T5CON_NOT_SYNC_POSN                                0x2
#define _T5CON_NOT_SYNC_POSITION                            0x2
#define _T5CON_NOT_SYNC_SIZE                                0x1
#define _T5CON_NOT_SYNC_LENGTH                              0x1
#define _T5CON_NOT_SYNC_MASK                                0x4
#define _T5CON_ON_POSN                                      0x0
#define _T5CON_ON_POSITION                                  0x0
#define _T5CON_ON_SIZE                                      0x1
#define _T5CON_ON_LENGTH                                    0x1
#define _T5CON_ON_MASK                                      0x1
#define _T5CON_RD16_POSN                                    0x1
#define _T5CON_RD16_POSITION                                0x1
#define _T5CON_RD16_SIZE                                    0x1
#define _T5CON_RD16_LENGTH                                  0x1
#define _T5CON_RD16_MASK                                    0x2
#define _T5CON_nSYNC_POSN                                   0x2
#define _T5CON_nSYNC_POSITION                               0x2
#define _T5CON_nSYNC_SIZE                                   0x1
#define _T5CON_nSYNC_LENGTH                                 0x1
#define _T5CON_nSYNC_MASK                                   0x4
#define _T5CON_CKPS_POSN                                    0x4
#define _T5CON_CKPS_POSITION                                0x4
#define _T5CON_CKPS_SIZE                                    0x2
#define _T5CON_CKPS_LENGTH                                  0x2
#define _T5CON_CKPS_MASK                                    0x30
#define _T5CON_NOT_T5SYNC_POSN                              0x2
#define _T5CON_NOT_T5SYNC_POSITION                          0x2
#define _T5CON_NOT_T5SYNC_SIZE                              0x1
#define _T5CON_NOT_T5SYNC_LENGTH                            0x1
#define _T5CON_NOT_T5SYNC_MASK                              0x4
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_T5RD16_POSN                                  0x1
#define _T5CON_T5RD16_POSITION                              0x1
#define _T5CON_T5RD16_SIZE                                  0x1
#define _T5CON_T5RD16_LENGTH                                0x1
#define _T5CON_T5RD16_MASK                                  0x2
#define _T5CON_nT5SYNC_POSN                                 0x2
#define _T5CON_nT5SYNC_POSITION                             0x2
#define _T5CON_nT5SYNC_SIZE                                 0x1
#define _T5CON_nT5SYNC_LENGTH                               0x1
#define _T5CON_nT5SYNC_MASK                                 0x4
#define _T5CON_T5CKPS0_POSN                                 0x4
#define _T5CON_T5CKPS0_POSITION                             0x4
#define _T5CON_T5CKPS0_SIZE                                 0x1
#define _T5CON_T5CKPS0_LENGTH                               0x1
#define _T5CON_T5CKPS0_MASK                                 0x10
#define _T5CON_T5CKPS1_POSN                                 0x5
#define _T5CON_T5CKPS1_POSITION                             0x5
#define _T5CON_T5CKPS1_SIZE                                 0x1
#define _T5CON_T5CKPS1_LENGTH                               0x1
#define _T5CON_T5CKPS1_MASK                                 0x20
#define _T5CON_CKPS0_POSN                                   0x4
#define _T5CON_CKPS0_POSITION                               0x4
#define _T5CON_CKPS0_SIZE                                   0x1
#define _T5CON_CKPS0_LENGTH                                 0x1
#define _T5CON_CKPS0_MASK                                   0x10
#define _T5CON_CKPS1_POSN                                   0x5
#define _T5CON_CKPS1_POSITION                               0x5
#define _T5CON_CKPS1_SIZE                                   0x1
#define _T5CON_CKPS1_LENGTH                                 0x1
#define _T5CON_CKPS1_MASK                                   0x20
#define _T5CON_RD165_POSN                                   0x1
#define _T5CON_RD165_POSITION                               0x1
#define _T5CON_RD165_SIZE                                   0x1
#define _T5CON_RD165_LENGTH                                 0x1
#define _T5CON_RD165_MASK                                   0x2

// Register: T5GCON
#define T5GCON T5GCON
extern volatile unsigned char           T5GCON              __at(0xFC3);
#ifndef _LIB_BUILD
asm("T5GCON equ 0FC3h");
#endif
// aliases
extern volatile unsigned char           PR5                 __at(0xFC3);
#ifndef _LIB_BUILD
asm("PR5 equ 0FC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO                  :1;
    };
} T5GCONbits_t;
