GopalSaraf/Practicals/PSDL/include/proc/pic18f27q10.h
extern volatile __bit                   LC6G2D2T            __at(0x7303);	// @ (0xE60 * 8 + 3)
#define                                 LC6G2D2T_bit        _BIT_ACCESS(CLC6GLS1,3)
// CLC6GLS1<LC6G2D3N>
extern volatile __bit                   LC6G2D3N            __at(0x7304);	// @ (0xE60 * 8 + 4)
#define                                 LC6G2D3N_bit        _BIT_ACCESS(CLC6GLS1,4)
// CLC6GLS1<LC6G2D3T>
extern volatile __bit                   LC6G2D3T            __at(0x7305);	// @ (0xE60 * 8 + 5)
#define                                 LC6G2D3T_bit        _BIT_ACCESS(CLC6GLS1,5)
// CLC6GLS1<LC6G2D4N>
extern volatile __bit                   LC6G2D4N            __at(0x7306);	// @ (0xE60 * 8 + 6)
#define                                 LC6G2D4N_bit        _BIT_ACCESS(CLC6GLS1,6)
// CLC6GLS1<LC6G2D4T>
extern volatile __bit                   LC6G2D4T            __at(0x7307);	// @ (0xE60 * 8 + 7)
#define                                 LC6G2D4T_bit        _BIT_ACCESS(CLC6GLS1,7)
// CLC6POL<LC6G2POL>
extern volatile __bit                   LC6G2POL            __at(0x72D1);	// @ (0xE5A * 8 + 1)
#define                                 LC6G2POL_bit        _BIT_ACCESS(CLC6POL,1)
// CLC6GLS2<LC6G3D1N>
extern volatile __bit                   LC6G3D1N            __at(0x7308);	// @ (0xE61 * 8 + 0)
#define                                 LC6G3D1N_bit        _BIT_ACCESS(CLC6GLS2,0)
// CLC6GLS2<LC6G3D1T>
extern volatile __bit                   LC6G3D1T            __at(0x7309);	// @ (0xE61 * 8 + 1)
#define                                 LC6G3D1T_bit        _BIT_ACCESS(CLC6GLS2,1)
// CLC6GLS2<LC6G3D2N>
extern volatile __bit                   LC6G3D2N            __at(0x730A);	// @ (0xE61 * 8 + 2)
#define                                 LC6G3D2N_bit        _BIT_ACCESS(CLC6GLS2,2)
// CLC6GLS2<LC6G3D2T>
extern volatile __bit                   LC6G3D2T            __at(0x730B);	// @ (0xE61 * 8 + 3)
#define                                 LC6G3D2T_bit        _BIT_ACCESS(CLC6GLS2,3)
// CLC6GLS2<LC6G3D3N>
extern volatile __bit                   LC6G3D3N            __at(0x730C);	// @ (0xE61 * 8 + 4)
#define                                 LC6G3D3N_bit        _BIT_ACCESS(CLC6GLS2,4)
// CLC6GLS2<LC6G3D3T>
extern volatile __bit                   LC6G3D3T            __at(0x730D);	// @ (0xE61 * 8 + 5)
#define                                 LC6G3D3T_bit        _BIT_ACCESS(CLC6GLS2,5)
// CLC6GLS2<LC6G3D4N>
extern volatile __bit                   LC6G3D4N            __at(0x730E);	// @ (0xE61 * 8 + 6)
#define                                 LC6G3D4N_bit        _BIT_ACCESS(CLC6GLS2,6)
// CLC6GLS2<LC6G3D4T>
extern volatile __bit                   LC6G3D4T            __at(0x730F);	// @ (0xE61 * 8 + 7)
#define                                 LC6G3D4T_bit        _BIT_ACCESS(CLC6GLS2,7)
// CLC6POL<LC6G3POL>
extern volatile __bit                   LC6G3POL            __at(0x72D2);	// @ (0xE5A * 8 + 2)
#define                                 LC6G3POL_bit        _BIT_ACCESS(CLC6POL,2)
// CLC6GLS3<LC6G4D1N>
extern volatile __bit                   LC6G4D1N            __at(0x7310);	// @ (0xE62 * 8 + 0)
#define                                 LC6G4D1N_bit        _BIT_ACCESS(CLC6GLS3,0)
// CLC6GLS3<LC6G4D1T>
extern volatile __bit                   LC6G4D1T            __at(0x7311);	// @ (0xE62 * 8 + 1)
#define                                 LC6G4D1T_bit        _BIT_ACCESS(CLC6GLS3,1)
// CLC6GLS3<LC6G4D2N>
extern volatile __bit                   LC6G4D2N            __at(0x7312);	// @ (0xE62 * 8 + 2)
#define                                 LC6G4D2N_bit        _BIT_ACCESS(CLC6GLS3,2)
// CLC6GLS3<LC6G4D2T>
extern volatile __bit                   LC6G4D2T            __at(0x7313);	// @ (0xE62 * 8 + 3)
#define                                 LC6G4D2T_bit        _BIT_ACCESS(CLC6GLS3,3)
// CLC6GLS3<LC6G4D3N>
extern volatile __bit                   LC6G4D3N            __at(0x7314);	// @ (0xE62 * 8 + 4)
#define                                 LC6G4D3N_bit        _BIT_ACCESS(CLC6GLS3,4)
// CLC6GLS3<LC6G4D3T>
extern volatile __bit                   LC6G4D3T            __at(0x7315);	// @ (0xE62 * 8 + 5)
#define                                 LC6G4D3T_bit        _BIT_ACCESS(CLC6GLS3,5)
// CLC6GLS3<LC6G4D4N>
extern volatile __bit                   LC6G4D4N            __at(0x7316);	// @ (0xE62 * 8 + 6)
#define                                 LC6G4D4N_bit        _BIT_ACCESS(CLC6GLS3,6)
// CLC6GLS3<LC6G4D4T>
extern volatile __bit                   LC6G4D4T            __at(0x7317);	// @ (0xE62 * 8 + 7)
#define                                 LC6G4D4T_bit        _BIT_ACCESS(CLC6GLS3,7)
// CLC6POL<LC6G4POL>
extern volatile __bit                   LC6G4POL            __at(0x72D3);	// @ (0xE5A * 8 + 3)
#define                                 LC6G4POL_bit        _BIT_ACCESS(CLC6POL,3)
// CLC6CON<LC6INTN>
extern volatile __bit                   LC6INTN             __at(0x72CB);	// @ (0xE59 * 8 + 3)
#define                                 LC6INTN_bit         _BIT_ACCESS(CLC6CON,3)
// CLC6CON<LC6INTP>
extern volatile __bit                   LC6INTP             __at(0x72CC);	// @ (0xE59 * 8 + 4)
#define                                 LC6INTP_bit         _BIT_ACCESS(CLC6CON,4)
// CLC6CON<LC6MODE0>
extern volatile __bit                   LC6MODE0            __at(0x72C8);	// @ (0xE59 * 8 + 0)
#define                                 LC6MODE0_bit        _BIT_ACCESS(CLC6CON,0)
// CLC6CON<LC6MODE1>
extern volatile __bit                   LC6MODE1            __at(0x72C9);	// @ (0xE59 * 8 + 1)
#define                                 LC6MODE1_bit        _BIT_ACCESS(CLC6CON,1)
// CLC6CON<LC6MODE2>
extern volatile __bit                   LC6MODE2            __at(0x72CA);	// @ (0xE59 * 8 + 2)
#define                                 LC6MODE2_bit        _BIT_ACCESS(CLC6CON,2)
// CLC6CON<LC6OUT>
extern volatile __bit                   LC6OUT              __at(0x72CD);	// @ (0xE59 * 8 + 5)
#define                                 LC6OUT_bit          _BIT_ACCESS(CLC6CON,5)
// CLC6POL<LC6POL>
extern volatile __bit                   LC6POL              __at(0x72D7);	// @ (0xE5A * 8 + 7)
#define                                 LC6POL_bit          _BIT_ACCESS(CLC6POL,7)
// CLC7SEL0<LC7D1S0>
extern volatile __bit                   LC7D1S0             __at(0x7328);	// @ (0xE65 * 8 + 0)
#define                                 LC7D1S0_bit         _BIT_ACCESS(CLC7SEL0,0)
// CLC7SEL0<LC7D1S1>
extern volatile __bit                   LC7D1S1             __at(0x7329);	// @ (0xE65 * 8 + 1)
#define                                 LC7D1S1_bit         _BIT_ACCESS(CLC7SEL0,1)
// CLC7SEL0<LC7D1S2>
extern volatile __bit                   LC7D1S2             __at(0x732A);	// @ (0xE65 * 8 + 2)
#define                                 LC7D1S2_bit         _BIT_ACCESS(CLC7SEL0,2)
// CLC7SEL0<LC7D1S3>
extern volatile __bit                   LC7D1S3             __at(0x732B);	// @ (0xE65 * 8 + 3)
#define                                 LC7D1S3_bit         _BIT_ACCESS(CLC7SEL0,3)
// CLC7SEL0<LC7D1S4>
extern volatile __bit                   LC7D1S4             __at(0x732C);	// @ (0xE65 * 8 + 4)
#define                                 LC7D1S4_bit         _BIT_ACCESS(CLC7SEL0,4)
// CLC7SEL0<LC7D1S5>
extern volatile __bit                   LC7D1S5             __at(0x732D);	// @ (0xE65 * 8 + 5)
#define                                 LC7D1S5_bit         _BIT_ACCESS(CLC7SEL0,5)
// CLC7SEL0<LC7D1S6>
extern volatile __bit                   LC7D1S6             __at(0x732E);	// @ (0xE65 * 8 + 6)
#define                                 LC7D1S6_bit         _BIT_ACCESS(CLC7SEL0,6)
// CLC7SEL0<LC7D1S7>
extern volatile __bit                   LC7D1S7             __at(0x732F);	// @ (0xE65 * 8 + 7)
#define                                 LC7D1S7_bit         _BIT_ACCESS(CLC7SEL0,7)
// CLC7SEL1<LC7D2S0>
extern volatile __bit                   LC7D2S0             __at(0x7330);	// @ (0xE66 * 8 + 0)
#define                                 LC7D2S0_bit         _BIT_ACCESS(CLC7SEL1,0)
// CLC7SEL1<LC7D2S1>
extern volatile __bit                   LC7D2S1             __at(0x7331);	// @ (0xE66 * 8 + 1)
#define                                 LC7D2S1_bit         _BIT_ACCESS(CLC7SEL1,1)
// CLC7SEL1<LC7D2S2>
extern volatile __bit                   LC7D2S2             __at(0x7332);	// @ (0xE66 * 8 + 2)
#define                                 LC7D2S2_bit         _BIT_ACCESS(CLC7SEL1,2)
// CLC7SEL1<LC7D2S3>
extern volatile __bit                   LC7D2S3             __at(0x7333);	// @ (0xE66 * 8 + 3)
#define                                 LC7D2S3_bit         _BIT_ACCESS(CLC7SEL1,3)
// CLC7SEL1<LC7D2S4>
extern volatile __bit                   LC7D2S4             __at(0x7334);	// @ (0xE66 * 8 + 4)
#define                                 LC7D2S4_bit         _BIT_ACCESS(CLC7SEL1,4)
// CLC7SEL1<LC7D2S5>
extern volatile __bit                   LC7D2S5             __at(0x7335);	// @ (0xE66 * 8 + 5)
#define                                 LC7D2S5_bit         _BIT_ACCESS(CLC7SEL1,5)
// CLC7SEL1<LC7D2S6>
extern volatile __bit                   LC7D2S6             __at(0x7336);	// @ (0xE66 * 8 + 6)
#define                                 LC7D2S6_bit         _BIT_ACCESS(CLC7SEL1,6)
// CLC7SEL1<LC7D2S7>
extern volatile __bit                   LC7D2S7             __at(0x7337);	// @ (0xE66 * 8 + 7)
#define                                 LC7D2S7_bit         _BIT_ACCESS(CLC7SEL1,7)
// CLC7SEL2<LC7D3S0>
extern volatile __bit                   LC7D3S0             __at(0x7338);	// @ (0xE67 * 8 + 0)
#define                                 LC7D3S0_bit         _BIT_ACCESS(CLC7SEL2,0)
// CLC7SEL2<LC7D3S1>
extern volatile __bit                   LC7D3S1             __at(0x7339);	// @ (0xE67 * 8 + 1)
#define                                 LC7D3S1_bit         _BIT_ACCESS(CLC7SEL2,1)
// CLC7SEL2<LC7D3S2>
extern volatile __bit                   LC7D3S2             __at(0x733A);	// @ (0xE67 * 8 + 2)
#define                                 LC7D3S2_bit         _BIT_ACCESS(CLC7SEL2,2)
// CLC7SEL2<LC7D3S3>
extern volatile __bit                   LC7D3S3             __at(0x733B);	// @ (0xE67 * 8 + 3)
#define                                 LC7D3S3_bit         _BIT_ACCESS(CLC7SEL2,3)
// CLC7SEL2<LC7D3S4>
extern volatile __bit                   LC7D3S4             __at(0x733C);	// @ (0xE67 * 8 + 4)
#define                                 LC7D3S4_bit         _BIT_ACCESS(CLC7SEL2,4)
// CLC7SEL2<LC7D3S5>
extern volatile __bit                   LC7D3S5             __at(0x733D);	// @ (0xE67 * 8 + 5)
#define                                 LC7D3S5_bit         _BIT_ACCESS(CLC7SEL2,5)
// CLC7SEL2<LC7D3S6>
extern volatile __bit                   LC7D3S6             __at(0x733E);	// @ (0xE67 * 8 + 6)
#define                                 LC7D3S6_bit         _BIT_ACCESS(CLC7SEL2,6)
// CLC7SEL2<LC7D3S7>
extern volatile __bit                   LC7D3S7             __at(0x733F);	// @ (0xE67 * 8 + 7)
#define                                 LC7D3S7_bit         _BIT_ACCESS(CLC7SEL2,7)
// CLC7SEL3<LC7D4S0>
extern volatile __bit                   LC7D4S0             __at(0x7340);	// @ (0xE68 * 8 + 0)
#define                                 LC7D4S0_bit         _BIT_ACCESS(CLC7SEL3,0)
// CLC7SEL3<LC7D4S1>
extern volatile __bit                   LC7D4S1             __at(0x7341);	// @ (0xE68 * 8 + 1)
#define                                 LC7D4S1_bit         _BIT_ACCESS(CLC7SEL3,1)
// CLC7SEL3<LC7D4S2>
extern volatile __bit                   LC7D4S2             __at(0x7342);	// @ (0xE68 * 8 + 2)
#define                                 LC7D4S2_bit         _BIT_ACCESS(CLC7SEL3,2)
// CLC7SEL3<LC7D4S3>
extern volatile __bit                   LC7D4S3             __at(0x7343);	// @ (0xE68 * 8 + 3)
#define                                 LC7D4S3_bit         _BIT_ACCESS(CLC7SEL3,3)
// CLC7SEL3<LC7D4S4>
extern volatile __bit                   LC7D4S4             __at(0x7344);	// @ (0xE68 * 8 + 4)
#define                                 LC7D4S4_bit         _BIT_ACCESS(CLC7SEL3,4)
// CLC7SEL3<LC7D4S5>
extern volatile __bit                   LC7D4S5             __at(0x7345);	// @ (0xE68 * 8 + 5)
#define                                 LC7D4S5_bit         _BIT_ACCESS(CLC7SEL3,5)
// CLC7SEL3<LC7D4S6>
extern volatile __bit                   LC7D4S6             __at(0x7346);	// @ (0xE68 * 8 + 6)
#define                                 LC7D4S6_bit         _BIT_ACCESS(CLC7SEL3,6)
// CLC7SEL3<LC7D4S7>
extern volatile __bit                   LC7D4S7             __at(0x7347);	// @ (0xE68 * 8 + 7)
#define                                 LC7D4S7_bit         _BIT_ACCESS(CLC7SEL3,7)
// CLC7CON<LC7EN>
extern volatile __bit                   LC7EN               __at(0x731F);	// @ (0xE63 * 8 + 7)
#define                                 LC7EN_bit           _BIT_ACCESS(CLC7CON,7)
// CLC7GLS0<LC7G1D1N>
extern volatile __bit                   LC7G1D1N            __at(0x7348);	// @ (0xE69 * 8 + 0)
#define                                 LC7G1D1N_bit        _BIT_ACCESS(CLC7GLS0,0)
// CLC7GLS0<LC7G1D1T>
extern volatile __bit                   LC7G1D1T            __at(0x7349);	// @ (0xE69 * 8 + 1)
#define                                 LC7G1D1T_bit        _BIT_ACCESS(CLC7GLS0,1)
// CLC7GLS0<LC7G1D2N>
extern volatile __bit                   LC7G1D2N            __at(0x734A);	// @ (0xE69 * 8 + 2)
#define                                 LC7G1D2N_bit        _BIT_ACCESS(CLC7GLS0,2)
// CLC7GLS0<LC7G1D2T>
extern volatile __bit                   LC7G1D2T            __at(0x734B);	// @ (0xE69 * 8 + 3)
#define                                 LC7G1D2T_bit        _BIT_ACCESS(CLC7GLS0,3)
// CLC7GLS0<LC7G1D3N>
extern volatile __bit                   LC7G1D3N            __at(0x734C);	// @ (0xE69 * 8 + 4)
#define                                 LC7G1D3N_bit        _BIT_ACCESS(CLC7GLS0,4)
// CLC7GLS0<LC7G1D3T>
extern volatile __bit                   LC7G1D3T            __at(0x734D);	// @ (0xE69 * 8 + 5)
#define                                 LC7G1D3T_bit        _BIT_ACCESS(CLC7GLS0,5)
// CLC7GLS0<LC7G1D4N>
extern volatile __bit                   LC7G1D4N            __at(0x734E);	// @ (0xE69 * 8 + 6)
#define                                 LC7G1D4N_bit        _BIT_ACCESS(CLC7GLS0,6)
// CLC7GLS0<LC7G1D4T>
extern volatile __bit                   LC7G1D4T            __at(0x734F);	// @ (0xE69 * 8 + 7)
#define                                 LC7G1D4T_bit        _BIT_ACCESS(CLC7GLS0,7)
// CLC7POL<LC7G1POL>
extern volatile __bit                   LC7G1POL            __at(0x7320);	// @ (0xE64 * 8 + 0)
#define                                 LC7G1POL_bit        _BIT_ACCESS(CLC7POL,0)
// CLC7GLS1<LC7G2D1N>
extern volatile __bit                   LC7G2D1N            __at(0x7350);	// @ (0xE6A * 8 + 0)
#define                                 LC7G2D1N_bit        _BIT_ACCESS(CLC7GLS1,0)
// CLC7GLS1<LC7G2D1T>
extern volatile __bit                   LC7G2D1T            __at(0x7351);	// @ (0xE6A * 8 + 1)
#define                                 LC7G2D1T_bit        _BIT_ACCESS(CLC7GLS1,1)
// CLC7GLS1<LC7G2D2N>
extern volatile __bit                   LC7G2D2N            __at(0x7352);	// @ (0xE6A * 8 + 2)
#define                                 LC7G2D2N_bit        _BIT_ACCESS(CLC7GLS1,2)
// CLC7GLS1<LC7G2D2T>
extern volatile __bit                   LC7G2D2T            __at(0x7353);	// @ (0xE6A * 8 + 3)
#define                                 LC7G2D2T_bit        _BIT_ACCESS(CLC7GLS1,3)
// CLC7GLS1<LC7G2D3N>
extern volatile __bit                   LC7G2D3N            __at(0x7354);	// @ (0xE6A * 8 + 4)
#define                                 LC7G2D3N_bit        _BIT_ACCESS(CLC7GLS1,4)
// CLC7GLS1<LC7G2D3T>
extern volatile __bit                   LC7G2D3T            __at(0x7355);	// @ (0xE6A * 8 + 5)
#define                                 LC7G2D3T_bit        _BIT_ACCESS(CLC7GLS1,5)
// CLC7GLS1<LC7G2D4N>
extern volatile __bit                   LC7G2D4N            __at(0x7356);	// @ (0xE6A * 8 + 6)
#define                                 LC7G2D4N_bit        _BIT_ACCESS(CLC7GLS1,6)
// CLC7GLS1<LC7G2D4T>
extern volatile __bit                   LC7G2D4T            __at(0x7357);	// @ (0xE6A * 8 + 7)
#define                                 LC7G2D4T_bit        _BIT_ACCESS(CLC7GLS1,7)
// CLC7POL<LC7G2POL>
extern volatile __bit                   LC7G2POL            __at(0x7321);	// @ (0xE64 * 8 + 1)
#define                                 LC7G2POL_bit        _BIT_ACCESS(CLC7POL,1)
// CLC7GLS2<LC7G3D1N>
extern volatile __bit                   LC7G3D1N            __at(0x7358);	// @ (0xE6B * 8 + 0)
#define                                 LC7G3D1N_bit        _BIT_ACCESS(CLC7GLS2,0)
// CLC7GLS2<LC7G3D1T>
extern volatile __bit                   LC7G3D1T            __at(0x7359);	// @ (0xE6B * 8 + 1)
#define                                 LC7G3D1T_bit        _BIT_ACCESS(CLC7GLS2,1)
// CLC7GLS2<LC7G3D2N>
extern volatile __bit                   LC7G3D2N            __at(0x735A);	// @ (0xE6B * 8 + 2)
#define                                 LC7G3D2N_bit        _BIT_ACCESS(CLC7GLS2,2)
// CLC7GLS2<LC7G3D2T>
extern volatile __bit                   LC7G3D2T            __at(0x735B);	// @ (0xE6B * 8 + 3)
#define                                 LC7G3D2T_bit        _BIT_ACCESS(CLC7GLS2,3)
// CLC7GLS2<LC7G3D3N>
extern volatile __bit                   LC7G3D3N            __at(0x735C);	// @ (0xE6B * 8 + 4)
#define                                 LC7G3D3N_bit        _BIT_ACCESS(CLC7GLS2,4)
// CLC7GLS2<LC7G3D3T>
extern volatile __bit                   LC7G3D3T            __at(0x735D);	// @ (0xE6B * 8 + 5)
#define                                 LC7G3D3T_bit        _BIT_ACCESS(CLC7GLS2,5)
// CLC7GLS2<LC7G3D4N>
extern volatile __bit                   LC7G3D4N            __at(0x735E);	// @ (0xE6B * 8 + 6)
#define                                 LC7G3D4N_bit        _BIT_ACCESS(CLC7GLS2,6)
// CLC7GLS2<LC7G3D4T>
extern volatile __bit                   LC7G3D4T            __at(0x735F);	// @ (0xE6B * 8 + 7)
#define                                 LC7G3D4T_bit        _BIT_ACCESS(CLC7GLS2,7)
// CLC7POL<LC7G3POL>
extern volatile __bit                   LC7G3POL            __at(0x7322);	// @ (0xE64 * 8 + 2)
#define                                 LC7G3POL_bit        _BIT_ACCESS(CLC7POL,2)
// CLC7GLS3<LC7G4D1N>
extern volatile __bit                   LC7G4D1N            __at(0x7360);	// @ (0xE6C * 8 + 0)
#define                                 LC7G4D1N_bit        _BIT_ACCESS(CLC7GLS3,0)
// CLC7GLS3<LC7G4D1T>
extern volatile __bit                   LC7G4D1T            __at(0x7361);	// @ (0xE6C * 8 + 1)
#define                                 LC7G4D1T_bit        _BIT_ACCESS(CLC7GLS3,1)
// CLC7GLS3<LC7G4D2N>
extern volatile __bit                   LC7G4D2N            __at(0x7362);	// @ (0xE6C * 8 + 2)
#define                                 LC7G4D2N_bit        _BIT_ACCESS(CLC7GLS3,2)
// CLC7GLS3<LC7G4D2T>
extern volatile __bit                   LC7G4D2T            __at(0x7363);	// @ (0xE6C * 8 + 3)
#define                                 LC7G4D2T_bit        _BIT_ACCESS(CLC7GLS3,3)
// CLC7GLS3<LC7G4D3N>
extern volatile __bit                   LC7G4D3N            __at(0x7364);	// @ (0xE6C * 8 + 4)
#define                                 LC7G4D3N_bit        _BIT_ACCESS(CLC7GLS3,4)
// CLC7GLS3<LC7G4D3T>
extern volatile __bit                   LC7G4D3T            __at(0x7365);	// @ (0xE6C * 8 + 5)
#define                                 LC7G4D3T_bit        _BIT_ACCESS(CLC7GLS3,5)
// CLC7GLS3<LC7G4D4N>
extern volatile __bit                   LC7G4D4N            __at(0x7366);	// @ (0xE6C * 8 + 6)
#define                                 LC7G4D4N_bit        _BIT_ACCESS(CLC7GLS3,6)
// CLC7GLS3<LC7G4D4T>
extern volatile __bit                   LC7G4D4T            __at(0x7367);	// @ (0xE6C * 8 + 7)
#define                                 LC7G4D4T_bit        _BIT_ACCESS(CLC7GLS3,7)
// CLC7POL<LC7G4POL>
extern volatile __bit                   LC7G4POL            __at(0x7323);	// @ (0xE64 * 8 + 3)
#define                                 LC7G4POL_bit        _BIT_ACCESS(CLC7POL,3)
// CLC7CON<LC7INTN>
extern volatile __bit                   LC7INTN             __at(0x731B);	// @ (0xE63 * 8 + 3)
#define                                 LC7INTN_bit         _BIT_ACCESS(CLC7CON,3)
// CLC7CON<LC7INTP>
extern volatile __bit                   LC7INTP             __at(0x731C);	// @ (0xE63 * 8 + 4)
#define                                 LC7INTP_bit         _BIT_ACCESS(CLC7CON,4)
// CLC7CON<LC7MODE0>
extern volatile __bit                   LC7MODE0            __at(0x7318);	// @ (0xE63 * 8 + 0)
#define                                 LC7MODE0_bit        _BIT_ACCESS(CLC7CON,0)
// CLC7CON<LC7MODE1>
extern volatile __bit                   LC7MODE1            __at(0x7319);	// @ (0xE63 * 8 + 1)
#define                                 LC7MODE1_bit        _BIT_ACCESS(CLC7CON,1)
// CLC7CON<LC7MODE2>
extern volatile __bit                   LC7MODE2            __at(0x731A);	// @ (0xE63 * 8 + 2)
#define                                 LC7MODE2_bit        _BIT_ACCESS(CLC7CON,2)
// CLC7CON<LC7OUT>
extern volatile __bit                   LC7OUT              __at(0x731D);	// @ (0xE63 * 8 + 5)
#define                                 LC7OUT_bit          _BIT_ACCESS(CLC7CON,5)
// CLC7POL<LC7POL>
extern volatile __bit                   LC7POL              __at(0x7327);	// @ (0xE64 * 8 + 7)
#define                                 LC7POL_bit          _BIT_ACCESS(CLC7POL,7)
// CLC8SEL0<LC8D1S0>
extern volatile __bit                   LC8D1S0             __at(0x7378);	// @ (0xE6F * 8 + 0)
#define                                 LC8D1S0_bit         _BIT_ACCESS(CLC8SEL0,0)
// CLC8SEL0<LC8D1S1>
extern volatile __bit                   LC8D1S1             __at(0x7379);	// @ (0xE6F * 8 + 1)
#define                                 LC8D1S1_bit         _BIT_ACCESS(CLC8SEL0,1)
// CLC8SEL0<LC8D1S2>
extern volatile __bit                   LC8D1S2             __at(0x737A);	// @ (0xE6F * 8 + 2)
#define                                 LC8D1S2_bit         _BIT_ACCESS(CLC8SEL0,2)
// CLC8SEL0<LC8D1S3>
extern volatile __bit                   LC8D1S3             __at(0x737B);	// @ (0xE6F * 8 + 3)
#define                                 LC8D1S3_bit         _BIT_ACCESS(CLC8SEL0,3)
// CLC8SEL0<LC8D1S4>
extern volatile __bit                   LC8D1S4             __at(0x737C);	// @ (0xE6F * 8 + 4)
#define                                 LC8D1S4_bit         _BIT_ACCESS(CLC8SEL0,4)
// CLC8SEL0<LC8D1S5>
extern volatile __bit                   LC8D1S5             __at(0x737D);	// @ (0xE6F * 8 + 5)
#define                                 LC8D1S5_bit         _BIT_ACCESS(CLC8SEL0,5)
// CLC8SEL0<LC8D1S6>
extern volatile __bit                   LC8D1S6             __at(0x737E);	// @ (0xE6F * 8 + 6)
#define                                 LC8D1S6_bit         _BIT_ACCESS(CLC8SEL0,6)
// CLC8SEL0<LC8D1S7>
extern volatile __bit                   LC8D1S7             __at(0x737F);	// @ (0xE6F * 8 + 7)
#define                                 LC8D1S7_bit         _BIT_ACCESS(CLC8SEL0,7)
// CLC8SEL1<LC8D2S0>
extern volatile __bit                   LC8D2S0             __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 LC8D2S0_bit         _BIT_ACCESS(CLC8SEL1,0)
// CLC8SEL1<LC8D2S1>
extern volatile __bit                   LC8D2S1             __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 LC8D2S1_bit         _BIT_ACCESS(CLC8SEL1,1)
// CLC8SEL1<LC8D2S2>
extern volatile __bit                   LC8D2S2             __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 LC8D2S2_bit         _BIT_ACCESS(CLC8SEL1,2)
// CLC8SEL1<LC8D2S3>
extern volatile __bit                   LC8D2S3             __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 LC8D2S3_bit         _BIT_ACCESS(CLC8SEL1,3)
// CLC8SEL1<LC8D2S4>
extern volatile __bit                   LC8D2S4             __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 LC8D2S4_bit         _BIT_ACCESS(CLC8SEL1,4)
